In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:WECHALE$0398_wess@localhost:3306/loan_1

Connecting to 'mysql+pymysql://root:***@localhost:3306/loan_1'

In [4]:
%%sql

SELECT Property_Area,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100 / (SELECT COUNT(*) FROM loan_data_clean) AS Approval_by_Property_Area

FROM loan_data_clean

GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+---------------------------+
| Property_Area | Approval_by_Property_Area |
+---------------+---------------------------+
|       2       |          21.6612          |
|       0       |          17.9153          |
|       1       |          29.1531          |
+---------------+---------------------------+

In [5]:
%%sql

SELECT Dependents,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100 / (SELECT COUNT(*) FROM loan_data_clean) AS Approval_by_Dependents

FROM loan_data_clean

GROUP BY Dependents;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

4 rows affected.

+------------+------------------------+
| Dependents | Approval_by_Dependents |
+------------+------------------------+
|    0.0     |        40.2280         |
|    1.0     |        10.7492         |
|    2.0     |        12.3779         |
|    3.0     |         5.3746         |
+------------+------------------------+

In [6]:
%%sql

SELECT Married,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100 / (SELECT COUNT(*) FROM loan_data_clean) AS Approval_by_Marital_Status

FROM loan_data_clean

GROUP BY Married;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------+----------------------------+
| Married | Approval_by_Marital_Status |
+---------+----------------------------+
|    0    |          21.8241           |
|    1    |          46.4169           |
|    2    |           0.4886           |
+---------+----------------------------+

In [7]:
%%sql

SELECT Education,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100 / (SELECT COUNT(*) FROM loan_data_clean) AS Approval_by_Education

FROM loan_data_clean

GROUP BY Education;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-----------+-----------------------+
| Education | Approval_by_Education |
+-----------+-----------------------+
|     0     |        55.3746        |
|     1     |        13.3550        |
+-----------+-----------------------+

In [8]:
%%sql

SELECT Self_Employed,

SUM(CASE WHEN Loan_Status = 1 THEN 1 ELSE 0 END)*100 / (SELECT COUNT(*) FROM loan_data_clean) AS Approval_by_Employment_Status

FROM loan_data_clean

GROUP BY Self_Employed;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+-------------------------------+
| Self_Employed | Approval_by_Employment_Status |
+---------------+-------------------------------+
|       0       |            55.8632            |
|       1       |             9.1205            |
|       2       |             3.7459            |
+---------------+-------------------------------+

In [9]:
%%sql

SELECT * 

FROM loan_data_clean

WHERE LoanAmount / ApplicantIncome > (
    SELECT AVG(LoanAmount / ApplicantIncome) 
    FROM loan_data_clean WHERE ApplicantIncome > 0 AND LoanAmount > 0

);

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

80 rows affected.

+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+
| MyUnknownColumn | Gender | Married | Dependents | Education | Self_Employed | ApplicantIncome | CoapplicantIncome |     LoanAmount     | Loan_Amount_Term | Credit_History | Property_Area | Loan_Status |
+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+
|        13       |   1    |    0    |    0.0     |     0     |       0       |        24       |       2840.0      |       114.0        |      360.0       |      1.0       |       0       |      0      |
|        14       |   1    |    1    |    2.0     |     0     |       0       |        7        |       1086.0      |        17.0        |      120.0       |      1.0       |       2       |      1      |
|        28       |   1    |    0    |    0.0     |     1     |       0       |        9        |        0.0        |        35.0        |      360.0       |      1.0       |       2       |      0      |
|        35       |   1    |    1    |    0.0     |     0     |       0       |        59       |       2067.0      | 146.41216216216216 |      360.0       |      1.0       |       2       |      1      |
|        36       |   1    |    1    |    0.0     |     0     |       0       |        21       |       1330.0      |       100.0        |      360.0       |      0.0       |       2       |      0      |
|        41       |   1    |    0    |    0.0     |     0     |       0       |        17       |       1213.0      |        47.0        |      360.0       |      1.0       |       2       |      1      |
|        50       |   0    |    1    |    0.0     |     1     |       0       |        31       |       1644.0      |       100.0        |      360.0       |      1.0       |       1       |      1      |
|        56       |   1    |    1    |    0.0     |     0     |       0       |        45       |       1591.0      |        96.0        |      360.0       |      1.0       |       1       |      1      |
|        62       |   1    |    1    |    0.0     |     1     |       1       |        92       |       3449.0      |       165.0        |      180.0       |      0.0       |       0       |      0      |
|        71       |   1    |    1    |    2.0     |     1     |       1       |        26       |       1875.0      |        97.0        |      360.0       |      1.0       |       1       |      1      |
+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+
Truncated to displaylimit of 10.

In [18]:
%%sql

WITH Approved AS (
    SELECT * 
    FROM loan_data_clean
    WHERE Loan_Status = 1
)
SELECT Property_Area, COUNT(*) as Approved_by_Property_Area
FROM Approved 
GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+---------------------------+
| Property_Area | Approved_by_Property_Area |
+---------------+---------------------------+
|       2       |            133            |
|       1       |            179            |
|       0       |            110            |
+---------------+---------------------------+

In [19]:
%%sql

WITH Approved AS (
    SELECT * 
    FROM loan_data_clean
    WHERE Loan_Status = 1
)
SELECT Gender, COUNT(*) as Approvals_by_Gender
FROM Approved 
GROUP BY Gender;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+--------+---------------------+
| Gender | Approvals_by_Gender |
+--------+---------------------+
|   1    |         339         |
|   0    |          75         |
|   2    |          8          |
+--------+---------------------+

In [20]:
%%sql

WITH Approved AS (
    SELECT * 
    FROM loan_data_clean
    WHERE Loan_Status = 1
)
SELECT Married, COUNT(*) as Approval_by_Marital_Status
FROM Approved 
GROUP BY Married;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------+----------------------------+
| Married | Approval_by_Marital_Status |
+---------+----------------------------+
|    0    |            134             |
|    1    |            285             |
|    2    |             3              |
+---------+----------------------------+

In [21]:
%%sql

WITH Approved AS (
    SELECT * 
    FROM loan_data_clean
    WHERE Loan_Status = 1
)
SELECT Self_Employed, COUNT(*) as Approvals_by_Employment_Status
FROM Approved 
GROUP BY Self_Employed;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+--------------------------------+
| Self_Employed | Approvals_by_Employment_Status |
+---------------+--------------------------------+
|       0       |              343               |
|       1       |               56               |
|       2       |               23               |
+---------------+--------------------------------+

In [22]:
%%sql

WITH Approved AS (
    SELECT * 
    FROM loan_data_clean
    WHERE Loan_Status = 1
)
SELECT Dependents, COUNT(*) as Approval_by_Number_of_Dependents
FROM Approved 
GROUP BY Dependents;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

4 rows affected.

+------------+----------------------------------+
| Dependents | Approval_by_Number_of_Dependents |
+------------+----------------------------------+
|    0.0     |               247                |
|    2.0     |                76                |
|    1.0     |                66                |
|    3.0     |                33                |
+------------+----------------------------------+

In [23]:
%%sql

WITH AVG_LOANS AS (
    SELECT Property_Area, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    WHERE ApplicantIncome > 0 AND LoanAmount > 0
    GROUP BY Property_Area
)
SELECT * FROM AVG_LOANS;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+---------------------+
| Property_Area | AVERAGE_LOAN_AMOUNT |
+---------------+---------------------+
|       2       |  142.4283850682366  |
|       0       |  152.15996052232006 |
|       1       |  145.52386614081894 |
+---------------+---------------------+

In [24]:
%%sql

WITH AVG_LOANS AS (
    SELECT Gender, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    WHERE ApplicantIncome > 0 AND LoanAmount > 0
    GROUP BY Gender
)
SELECT * FROM AVG_LOANS;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+--------+---------------------+
| Gender | AVERAGE_LOAN_AMOUNT |
+--------+---------------------+
|   1    |  149.18408008418248 |
|   0    |  127.22532577220076 |
|   2    |  208.53846153846155 |
+--------+---------------------+

In [25]:
%%sql

WITH AVG_LOANS AS (
    SELECT Dependents, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    WHERE ApplicantIncome > 0 AND LoanAmount > 0
    GROUP BY Dependents
)
SELECT * FROM AVG_LOANS;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

4 rows affected.

+------------+---------------------+
| Dependents | AVERAGE_LOAN_AMOUNT |
+------------+---------------------+
|    0.0     |  135.99821200030112 |
|    1.0     |  158.14361420243773 |
|    2.0     |  150.11125234145035 |
|    3.0     |  189.15341812400635 |
+------------+---------------------+

In [26]:
%%sql

WITH AVG_LOANS AS (
    SELECT Self_Employed, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    WHERE ApplicantIncome > 0 AND LoanAmount > 0
    GROUP BY Self_Employed
)
SELECT * FROM AVG_LOANS;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+---------------------+
| Self_Employed | AVERAGE_LOAN_AMOUNT |
+---------------+---------------------+
|       0       |  141.9306992363104  |
|       1       |  171.0638595912986  |
|       2       |  153.48163006756755 |
+---------------+---------------------+

In [34]:
%%sql

SELECT ApplicantIncome, LoanAmount, Gender,
RANK() OVER (ORDER BY ApplicantIncome DESC) AS Applicant_Income_Ranking
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+-----------------+--------------------+--------+--------------------------+
| ApplicantIncome |     LoanAmount     | Gender | Applicant_Income_Ranking |
+-----------------+--------------------+--------+--------------------------+
|       504       |       360.0        |   1    |            1             |
|       503       |       490.0        |   1    |            2             |
|       502       |       700.0        |   2    |            3             |
|       501       |       600.0        |   1    |            4             |
|       500       |       120.0        |   1    |            5             |
|       499       |       152.0        |   1    |            6             |
|       498       |       260.0        |   1    |            7             |
|       497       |       370.0        |   2    |            8             |
|       496       |       480.0        |   1    |            9             |
|       495       | 146.41216216216216 |   1    |            10            |
+-----------------+--------------------+--------+--------------------------+
Truncated to displaylimit of 10.

In [38]:
%%sql

SELECT Gender, ApplicantIncome, LoanAmount, 
RANK() OVER (ORDER BY Gender DESC) AS Applicant_Income_Ranking
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+--------+-----------------+------------+--------------------------+
| Gender | ApplicantIncome | LoanAmount | Applicant_Income_Ranking |
+--------+-----------------+------------+--------------------------+
|   2    |       190       |   112.0    |            1             |
|   2    |       497       |   370.0    |            1             |
|   2    |       502       |   700.0    |            1             |
|   2    |        4        |   168.0    |            1             |
|   2    |        77       |   159.0    |            1             |
|   2    |       452       |   182.0    |            1             |
|   2    |        43       |   160.0    |            1             |
|   2    |       486       |   110.0    |            1             |
|   2    |       118       |   132.0    |            1             |
|   2    |       215       |    96.0    |            1             |
+--------+-----------------+------------+--------------------------+
Truncated to displaylimit of 10.

In [40]:
%%sql

SELECT Dependents, ApplicantIncome, LoanAmount, Gender,
RANK() OVER (ORDER BY Dependents ASC) AS Applicant_Income_Ranking
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+------------+-----------------+--------------------+--------+--------------------------+
| Dependents | ApplicantIncome |     LoanAmount     | Gender | Applicant_Income_Ranking |
+------------+-----------------+--------------------+--------+--------------------------+
|    0.0     |       376       | 146.41216216216216 |   1    |            1             |
|    0.0     |       139       |        66.0        |   1    |            1             |
|    0.0     |        90       |       120.0        |   1    |            1             |
|    0.0     |       381       |       141.0        |   1    |            1             |
|    0.0     |        65       |        95.0        |   1    |            1             |
|    0.0     |        24       |       114.0        |   1    |            1             |
|    0.0     |       337       |       125.0        |   1    |            1             |
|    0.0     |       208       |        76.0        |   0    |            1             |
|    0.0     |       331       |       133.0        |   1    |            1             |
|    0.0     |        91       |       115.0        |   1    |            1             |
+------------+-----------------+--------------------+--------+--------------------------+
Truncated to displaylimit of 10.

In [36]:
%%sql 

SELECT Property_Area, LoanAmount, ApplicantIncome, Gender,

ROW_NUMBER() OVER (PARTITION BY Property_Area ORDER BY ApplicantIncome DESC) AS RANK_OF_INCOME_BY_PROPERTY_AREA
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+---------------+--------------------+-----------------+--------+---------------------------------+
| Property_Area |     LoanAmount     | ApplicantIncome | Gender | RANK_OF_INCOME_BY_PROPERTY_AREA |
+---------------+--------------------+-----------------+--------+---------------------------------+
|       0       |       360.0        |       504       |   1    |                1                |
|       0       |       370.0        |       497       |   2    |                2                |
|       0       | 146.41216216216216 |       495       |   1    |                3                |
|       0       |       480.0        |       494       |   1    |                4                |
|       0       |       570.0        |       492       |   1    |                5                |
|       0       |       400.0        |       488       |   1    |                6                |
|       0       |       150.0        |       483       |   1    |                7                |
|       0       |       300.0        |       479       |   1    |                8                |
|       0       |       304.0        |       475       |   1    |                9                |
|       0       |       185.0        |       474       |   1    |                10               |
+---------------+--------------------+-----------------+--------+---------------------------------+
Truncated to displaylimit of 10.

In [5]:
%%sql

SELECT Property_Area, LoanAmount,

SUM(LoanAmount) OVER (PARTITION BY Property_Area ORDER BY LoanAmount DESC) AS CUMULATIVE_LOAN_AMOUNT_BY_PROPERTY_AREA
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+---------------+------------+-----------------------------------------+
| Property_Area | LoanAmount | CUMULATIVE_LOAN_AMOUNT_BY_PROPERTY_AREA |
+---------------+------------+-----------------------------------------+
|       0       |   570.0    |                  570.0                  |
|       0       |   480.0    |                  1530.0                 |
|       0       |   480.0    |                  1530.0                 |
|       0       |   400.0    |                  1930.0                 |
|       0       |   380.0    |                  2310.0                 |
|       0       |   376.0    |                  2686.0                 |
|       0       |   370.0    |                  3056.0                 |
|       0       |   360.0    |                  3416.0                 |
|       0       |   320.0    |                  3736.0                 |
|       0       |   311.0    |                  4047.0                 |
+---------------+------------+-----------------------------------------+
Truncated to displaylimit of 10.

In [6]:
%%sql

SELECT Dependents, LoanAmount,

SUM(LoanAmount) OVER (PARTITION BY Dependents ORDER BY LoanAmount DESC) AS CUMULATIVE_LOAN_AMOUNT_BY_DEPENDENTS
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+------------+------------+--------------------------------------+
| Dependents | LoanAmount | CUMULATIVE_LOAN_AMOUNT_BY_DEPENDENTS |
+------------+------------+--------------------------------------+
|    0.0     |   650.0    |                650.0                 |
|    0.0     |   570.0    |                1220.0                |
|    0.0     |   490.0    |                1710.0                |
|    0.0     |   480.0    |                2670.0                |
|    0.0     |   480.0    |                2670.0                |
|    0.0     |   436.0    |                3106.0                |
|    0.0     |   405.0    |                3511.0                |
|    0.0     |   324.0    |                3835.0                |
|    0.0     |   311.0    |                4146.0                |
|    0.0     |   308.0    |                4454.0                |
+------------+------------+--------------------------------------+
Truncated to displaylimit of 10.

In [7]:
%%sql

SELECT Gender, LoanAmount,

SUM(LoanAmount) OVER (PARTITION BY Gender ORDER BY LoanAmount DESC) AS CUMULATIVE_LOAN_AMOUNT_BY_GENDER
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+--------+------------+----------------------------------+
| Gender | LoanAmount | CUMULATIVE_LOAN_AMOUNT_BY_GENDER |
+--------+------------+----------------------------------+
|   0    |   600.0    |              600.0               |
|   0    |   496.0    |              1096.0              |
|   0    |   350.0    |              1446.0              |
|   0    |   286.0    |              1732.0              |
|   0    |   280.0    |              2012.0              |
|   0    |   259.0    |              2271.0              |
|   0    |   255.0    |              2526.0              |
|   0    |   225.0    |              2976.0              |
|   0    |   225.0    |              2976.0              |
|   0    |   214.0    |              3190.0              |
+--------+------------+----------------------------------+
Truncated to displaylimit of 10.

In [9]:
%%sql

SELECT Self_Employed, LoanAmount,

SUM(LoanAmount) OVER (PARTITION BY Self_Employed ORDER BY LoanAmount ASC) AS CUMULATIVE_LOAN_AMOUNT_BY_SELF_EMPLOYED
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+---------------+------------+-----------------------------------------+
| Self_Employed | LoanAmount | CUMULATIVE_LOAN_AMOUNT_BY_SELF_EMPLOYED |
+---------------+------------+-----------------------------------------+
|       0       |    9.0     |                   9.0                   |
|       0       |    17.0    |                   26.0                  |
|       0       |    25.0    |                   51.0                  |
|       0       |    26.0    |                   77.0                  |
|       0       |    30.0    |                  137.0                  |
|       0       |    30.0    |                  137.0                  |
|       0       |    35.0    |                  172.0                  |
|       0       |    36.0    |                  208.0                  |
|       0       |    40.0    |                  288.0                  |
|       0       |    40.0    |                  288.0                  |
+---------------+------------+-----------------------------------------+
Truncated to displaylimit of 10.

In [10]:
%%sql

SELECT LoanAmount,
AVG(LoanAmount) OVER (ORDER BY LoanAmount ROWS BETWEEN 2 PRECEDING AND 2 FOLLOWING) AS MOVING_AVERAGE_LOAN_AMOUNT
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+------------+----------------------------+
| LoanAmount | MOVING_AVERAGE_LOAN_AMOUNT |
+------------+----------------------------+
|    9.0     |            17.0            |
|    17.0    |            19.0            |
|    25.0    |            20.4            |
|    25.0    |            24.6            |
|    26.0    |            27.2            |
|    30.0    |            29.2            |
|    30.0    |            31.4            |
|    35.0    |            34.2            |
|    36.0    |            36.2            |
|    40.0    |            38.6            |
+------------+----------------------------+
Truncated to displaylimit of 10.

In [5]:
%%sql

SELECT ApplicantIncome, 

AVG(ApplicantIncome) OVER (ORDER BY ApplicantIncome ROWS BETWEEN 2 PRECEDING AND 2 FOLLOWING) AS MOVING_AVERAGE_APPLICANT_INCOME

FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+-----------------+---------------------------------+
| ApplicantIncome | MOVING_AVERAGE_APPLICANT_INCOME |
+-----------------+---------------------------------+
|        0        |              1.0000             |
|        1        |              1.5000             |
|        2        |              2.0000             |
|        3        |              3.0000             |
|        4        |              4.0000             |
|        5        |              4.8000             |
|        6        |              5.6000             |
|        6        |              6.4000             |
|        7        |              7.2000             |
|        8        |              8.0000             |
+-----------------+---------------------------------+
Truncated to displaylimit of 10.

In [12]:
%%sql

SELECT ApplicantIncome, LoanAmount,

NTILE(4) OVER (ORDER BY ApplicantIncome) as INCOME_QUARTILE
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+-----------------+------------+-----------------+
| ApplicantIncome | LoanAmount | INCOME_QUARTILE |
+-----------------+------------+-----------------+
|        0        |   135.0    |        1        |
|        1        |    98.0    |        1        |
|        2        |   350.0    |        1        |
|        3        |   113.0    |        1        |
|        4        |   168.0    |        1        |
|        5        |   110.0    |        1        |
|        6        |   112.0    |        1        |
|        6        |   216.0    |        1        |
|        7        |    17.0    |        1        |
|        8        |   167.0    |        1        |
+-----------------+------------+-----------------+
Truncated to displaylimit of 10.

In [6]:
%%sql

SELECT ApplicantIncome, LoanAmount,

NTILE(4) OVER (ORDER BY LoanAmount) as LOAN_AMOUNT_QUARTILES
FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

614 rows affected.

+-----------------+------------+-----------------------+
| ApplicantIncome | LoanAmount | LOAN_AMOUNT_QUARTILES |
+-----------------+------------+-----------------------+
|        68       |    9.0     |           1           |
|        7        |    17.0    |           1           |
|       224       |    25.0    |           1           |
|       202       |    25.0    |           1           |
|       354       |    26.0    |           1           |
|        11       |    30.0    |           1           |
|       175       |    30.0    |           1           |
|        9        |    35.0    |           1           |
|       165       |    36.0    |           1           |
|       472       |    40.0    |           1           |
+-----------------+------------+-----------------------+
Truncated to displaylimit of 10.

In [12]:
%%sql

WITH AVERAGE_LOAN_AMOUNT AS (
    SELECT Property_Area, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    GROUP BY Property_Area
)
SELECT * FROM AVERAGE_LOAN_AMOUNT

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+---------------------+
| Property_Area | AVERAGE_LOAN_AMOUNT |
+---------------+---------------------+
|       2       |  142.4283850682366  |
|       0       |  152.06409482107807 |
|       1       |  145.52386614081894 |
+---------------+---------------------+

In [13]:
%%sql

WITH AVERAGE_LOAN_AMOUNT AS (
    SELECT Self_Employed, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    GROUP BY Self_Employed
)
SELECT * FROM AVERAGE_LOAN_AMOUNT

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+---------------------+
| Self_Employed | AVERAGE_LOAN_AMOUNT |
+---------------+---------------------+
|       0       |  141.9168378378378  |
|       1       |  171.0638595912986  |
|       2       |  153.48163006756755 |
+---------------+---------------------+

In [14]:
%%sql

WITH AVERAGE_LOAN_AMOUNT AS (
    SELECT Gender, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    GROUP BY Gender
)
SELECT * FROM AVERAGE_LOAN_AMOUNT

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+--------+---------------------+
| Gender | AVERAGE_LOAN_AMOUNT |
+--------+---------------------+
|   1    |  149.15507378544183 |
|   0    |  127.22532577220076 |
|   2    |  208.53846153846155 |
+--------+---------------------+

In [15]:
%%sql

WITH AVERAGE_LOAN_AMOUNT AS (
    SELECT Loan_Status, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    GROUP BY Loan_Status
)
SELECT * FROM AVERAGE_LOAN_AMOUNT

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-------------+---------------------+
| Loan_Status | AVERAGE_LOAN_AMOUNT |
+-------------+---------------------+
|      1      |  144.34960612271036 |
|      0      |  150.94548845720723 |
+-------------+---------------------+

In [ ]:
%%sql

WITH AVERAGE_LOAN_AMOUNT AS (
    SELECT Dependents, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    GROUP BY Dependents
)
SELECT * FROM AVERAGE_LOAN_AMOUNT

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

4 rows affected.

+------------+---------------------+
| Dependents | AVERAGE_LOAN_AMOUNT |
+------------+---------------------+
|    0.0     |  135.9954391891892  |
|    1.0     |  158.14361420243773 |
|    2.0     |  150.11125234145035 |
|    3.0     |  189.15341812400635 |
+------------+---------------------+

In [18]:
%%sql

WITH AVERAGE_LOAN_AMOUNT AS (
    SELECT Gender, AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT
    FROM loan_data_clean
    GROUP BY Gender
)
SELECT * FROM AVERAGE_LOAN_AMOUNT

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+--------+---------------------+
| Gender | AVERAGE_LOAN_AMOUNT |
+--------+---------------------+
|   1    |  149.15507378544183 |
|   0    |  127.22532577220076 |
|   2    |  208.53846153846155 |
+--------+---------------------+

In [20]:
%%sql

WITH APPROVED_LOANS AS (
    SELECT * FROM loan_data_clean WHERE Loan_Status = 1
)
SELECT Property_Area, COUNT(*) AS COUNT_OF_APPROVALS
FROM APPROVED_LOANS GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+--------------------+
| Property_Area | COUNT_OF_APPROVALS |
+---------------+--------------------+
|       2       |        133         |
|       1       |        179         |
|       0       |        110         |
+---------------+--------------------+

In [21]:
%%sql

WITH APPROVED_LOANS AS (
    SELECT * FROM loan_data_clean WHERE Loan_Status = 1
)
SELECT Gender, COUNT(*) AS COUNT_OF_APPROVALS
FROM APPROVED_LOANS GROUP BY Gender;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+--------+--------------------+
| Gender | COUNT_OF_APPROVALS |
+--------+--------------------+
|   1    |        339         |
|   0    |         75         |
|   2    |         8          |
+--------+--------------------+

In [22]:
%%sql

WITH APPROVED_LOANS AS (
    SELECT * FROM loan_data_clean WHERE Loan_Status = 1
)
SELECT Self_Employed, COUNT(*) AS COUNT_OF_APPROVALS
FROM APPROVED_LOANS GROUP BY Self_Employed;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+--------------------+
| Self_Employed | COUNT_OF_APPROVALS |
+---------------+--------------------+
|       0       |        343         |
|       1       |         56         |
|       2       |         23         |
+---------------+--------------------+

In [23]:
%%sql

WITH APPROVED_LOANS AS (
    SELECT * FROM loan_data_clean WHERE Loan_Status = 1
)
SELECT Dependents, COUNT(*) AS COUNT_OF_APPROVALS
FROM APPROVED_LOANS GROUP BY Dependents;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

4 rows affected.

+------------+--------------------+
| Dependents | COUNT_OF_APPROVALS |
+------------+--------------------+
|    0.0     |        247         |
|    2.0     |         76         |
|    1.0     |         66         |
|    3.0     |         33         |
+------------+--------------------+

In [37]:
%%sql

WITH LOAN_INCOME_RATIO AS (
    SELECT LoanAmount, ApplicantIncome, Gender, Dependents, LoanAmount/ApplicantIncome AS Ratio
    FROM loan_data_clean WHERE ApplicantIncome > 0 AND LoanAmount > 0
)
SELECT * FROM LOAN_INCOME_RATIO WHERE Ratio > 0.5 AND Gender=0 AND Dependents=0;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

42 rows affected.

+------------+-----------------+--------+------------+--------------------+
| LoanAmount | ApplicantIncome | Gender | Dependents |       Ratio        |
+------------+-----------------+--------+------------+--------------------+
|   144.0    |       228       |   0    |    0.0     | 0.631578947368421  |
|   120.0    |        95       |   0    |    0.0     | 1.263157894736842  |
|   144.0    |       268       |   0    |    0.0     | 0.5373134328358209 |
|   100.0    |        31       |   0    |    0.0     | 3.225806451612903  |
|   120.0    |       154       |   0    |    0.0     | 0.7792207792207793 |
|   137.0    |        80       |   0    |    0.0     |       1.7125       |
|   139.0    |       129       |   0    |    0.0     | 1.0775193798449612 |
|   154.0    |       166       |   0    |    0.0     | 0.927710843373494  |
|   259.0    |       457       |   0    |    0.0     | 0.5667396061269147 |
|   137.0    |        46       |   0    |    0.0     | 2.9782608695652173 |
+------------+-----------------+--------+------------+--------------------+
Truncated to displaylimit of 10.

In [39]:
%%sql

WITH LOAN_INCOME_RATIO AS (
    SELECT LoanAmount, ApplicantIncome, Property_Area, LoanAmount/ApplicantIncome AS Ratio
    FROM loan_data_clean WHERE ApplicantIncome > 0 AND LoanAmount > 0
)
SELECT * FROM LOAN_INCOME_RATIO WHERE Ratio < 0.5 AND Property_Area=0;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

74 rows affected.

+--------------------+-----------------+---------------+---------------------+
|     LoanAmount     | ApplicantIncome | Property_Area |        Ratio        |
+--------------------+-----------------+---------------+---------------------+
|       128.0        |       306       |       0       | 0.41830065359477125 |
|       133.0        |       331       |       0       | 0.40181268882175225 |
|       106.0        |       317       |       0       |  0.334384858044164  |
| 146.41216216216216 |       336       |       0       |  0.4357504826254826 |
|       120.0        |       418       |       0       | 0.28708133971291866 |
|       185.0        |       474       |       0       | 0.39029535864978904 |
|       175.0        |       360       |       0       |  0.4861111111111111 |
|       180.0        |       362       |       0       |  0.4972375690607735 |
|        93.0        |       232       |       0       | 0.40086206896551724 |
|       182.0        |       386       |       0       | 0.47150259067357514 |
+--------------------+-----------------+---------------+---------------------+
Truncated to displaylimit of 10.

In [45]:
%%sql

WITH defaults AS (

    SELECT Education, SUM(CASE WHEN Loan_Status=0 THEN 1 ELSE 0 END) AS defaults,
    COUNT(*) AS total
    FROM loan_data_clean GROUP BY Education
)
SELECT Education, defaults*100.0/total as Default_Rate FROM defaults;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-----------+--------------+
| Education | Default_Rate |
+-----------+--------------+
|     0     |   29.16667   |
|     1     |   38.80597   |
+-----------+--------------+

In [46]:
%%sql

WITH defaults AS (

    SELECT Gender, SUM(CASE WHEN Loan_Status=0 THEN 1 ELSE 0 END) AS defaults,
    COUNT(*) AS total
    FROM loan_data_clean GROUP BY Gender
)
SELECT Gender, defaults*100.0/total as Default_Rate FROM defaults;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+--------+--------------+
| Gender | Default_Rate |
+--------+--------------+
|   1    |   30.67485   |
|   0    |   33.03571   |
|   2    |   38.46154   |
+--------+--------------+

In [47]:
%%sql

WITH defaults AS (

    SELECT Dependents, SUM(CASE WHEN Loan_Status=0 THEN 1 ELSE 0 END) AS defaults,
    COUNT(*) AS total
    FROM loan_data_clean GROUP BY Dependents
)
SELECT Dependents, defaults*100.0/total as Default_Rate FROM defaults;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

4 rows affected.

+------------+--------------+
| Dependents | Default_Rate |
+------------+--------------+
|    0.0     |   31.38889   |
|    1.0     |   35.29412   |
|    2.0     |   24.75248   |
|    3.0     |   35.29412   |
+------------+--------------+

In [48]:
%%sql

WITH defaults AS (

    SELECT Self_Employed, SUM(CASE WHEN Loan_Status=0 THEN 1 ELSE 0 END) AS defaults,
    COUNT(*) AS total
    FROM loan_data_clean GROUP BY Self_Employed
)
SELECT Self_Employed, defaults*100.0/total as Default_Rate FROM defaults;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+--------------+
| Self_Employed | Default_Rate |
+---------------+--------------+
|       0       |   31.40000   |
|       1       |   31.70732   |
|       2       |   28.12500   |
+---------------+--------------+

In [49]:
%%sql

WITH defaults AS (

    SELECT Property_Area, SUM(CASE WHEN Loan_Status=0 THEN 1 ELSE 0 END) AS defaults,
    COUNT(*) AS total
    FROM loan_data_clean GROUP BY Property_Area
)
SELECT Property_Area, defaults*100.0/total as Default_Rate FROM defaults;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+--------------+
| Property_Area | Default_Rate |
+---------------+--------------+
|       2       |   34.15842   |
|       0       |   38.54749   |
|       1       |   23.17597   |
+---------------+--------------+

In [3]:
%%sql 

SELECT Gender, Married, Education, Property_Area,
    SUM(CASE WHEN Loan_Status=1 THEN 1 ELSE 0 END)*100.0/COUNT(*) AS LOAN_APPROVAL_RATE
FROM loan_data_clean

GROUP BY Gender, Married, Education, Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

32 rows affected.

+--------+---------+-----------+---------------+--------------------+
| Gender | Married | Education | Property_Area | LOAN_APPROVAL_RATE |
+--------+---------+-----------+---------------+--------------------+
|   1    |    0    |     0     |       2       |      60.00000      |
|   1    |    1    |     0     |       0       |      68.35443      |
|   1    |    1    |     0     |       2       |      75.53191      |
|   1    |    1    |     1     |       2       |      58.62069      |
|   1    |    1    |     0     |       1       |      80.39216      |
|   1    |    0    |     0     |       0       |      58.06452      |
|   1    |    0    |     1     |       2       |      28.57143      |
|   0    |    0    |     0     |       2       |      65.21739      |
|   1    |    1    |     1     |       0       |      50.00000      |
|   1    |    1    |     1     |       1       |      72.00000      |
+--------+---------+-----------+---------------+--------------------+
Truncated to displaylimit of 10.